[
    {
      "id": 1,
      "name": "Baldur's Gate 3",
      "title": "Baldur's Gate 3",
      "description": "A critically acclaimed RPG, offering deep storytelling, tactical combat, and multiplayer co-op gameplay. Set in the Dungeons & Dragons universe, players can explore a vast world filled with choices and consequences.",
      "image": "https://example.com/images/baldurs_gate_3.jpg",
      "rating": 9.8
    },
    {
      "id": 2,
      "name": "The Legend of Zelda: Tears of the Kingdom",
      "title": "The Legend of Zelda: Tears of the Kingdom",
      "description": "The sequel to the highly successful Breath of the Wild, this action-adventure game continues Link's journey with new abilities and a vast open world full of puzzles, enemies, and secrets.",
      "image": "https://example.com/images/zelda_tears_of_the_kingdom.jpg",
      "rating": 9.7
    },
    {
      "id": 3,
      "name": "Starfield",
      "title": "Starfield",
      "description": "Bethesda's first new universe in over 25 years, Starfield is a space exploration RPG set in a vast galaxy. Players can explore planets, customize their ships, and embark on missions in an expansive universe.",
      "image": "https://example.com/images/starfield.jpg",
      "rating": 8.5
    },
    {
      "id": 4,
      "name": "Call of Duty: Modern Warfare III",
      "title": "Call of Duty: Modern Warfare III",
      "description": "The latest installment in the Call of Duty series, this game offers intense multiplayer action, a gripping single-player campaign, and refined mechanics that have become the franchise's hallmark.",
      "image": "https://example.com/images/cod_mw3.jpg",
      "rating": 8.7
    },
    {
      "id": 5,
      "name": "Spider-Man 2",
      "title": "Spider-Man 2",
      "description": "The highly anticipated sequel to Spider-Man (PS4), this open-world action game allows players to swing through New York City as both Peter Parker and Miles Morales, taking on new villains and challenges.",
      "image": "https://example.com/images/spiderman_2.jpg",
      "rating": 9.5
    },
    {
      "id": 6,
      "name": "Cyberpunk 2077: Phantom Liberty",
      "title": "Cyberpunk 2077: Phantom Liberty",
      "description": "The expansion to Cyberpunk 2077, bringing new areas to explore, new storylines, and additional gameplay mechanics. It introduces a new narrative set in a high-stakes world of cybernetic enhancements and corporate intrigue.",
      "image": "https://example.com/images/cyberpunk_phantom_liberty.jpg",
      "rating": 8.9
    }
  ]
  